artillery.yml
config:
    target: 'http://localhost:8080'
    phases:
        - duration: 10
          arrivalRate: 20
        - duration: 100
          arrivalRate: 100
        - duration: 10
          arrivalRate: 20
    engines:
        socketio-v3: {}

scenarios:
    - engine: socketio-v3
      flow:
          - loop:
                - emit:
                      channel: 'echo'
                      data: 'Hello world!'
                - think: 5
            count: 10